Revit 2027 API
BuiltInFailures.FamilyFailures.SizeLookupTableIsNotAvailableForType Property
 Size Lookup Table is not available for type [Family Symbol].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SizeLookupTableIsNotAvailableForType { get; }
Public Shared ReadOnly Property SizeLookupTableIsNotAvailableForType As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SizeLookupTableIsNotAvailableForType {
	FailureDefinitionId^ get ();
}
static member SizeLookupTableIsNotAvailableForType : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace